#добавляем нужные нам библиотеки
import pandas as pd
import numpy as np
#вводим датафрэйм
a = pd.DataFrame({"ФИО : " : ["Чебупель Карлик Асталопович","Гринвич Джейк Сиксевенович"], "Адрес : " : ["Ул. Пушкина, д. Колотушкина","ул. Черная, д. 1"], "Телефон: " : ["007675242","40452426967"], "Дата рождения: " : ["67.52.2026","69.42.2000"]})
print(a)
#вводим цикл согласно которому будет проверяться каждый элемент и выборочно проводиться над ним операция (вначале проходим по первой строчке, потом по второй и тд; i - номер строчки, j - номер столбика)
for i in range(len(a)) :
    for j in range(len(a.columns)):
      #выбор операции
       d = int(input("Удалить - 0, Добавить - 1, Изменить  - 2, Ничего не делать - любое число : "))
      #проверка того,что выбрали и последующая операция над элементом взависимости от выбора
       match d: 
         case 0:
          #удаление
           a.iloc[i,j] = np.nan
           print(a)
         case 1:
           #выбор того, что будем добавлять
           h = int(input("Напишите, что бы вы хотели добавить: строку(1) или столбец(2)? : "))
           #взависимости от выбора будет добавляться либо столбик в конец либо строчка в конец
           match h:
              case 1:
                 #добавление строчки
                 #введем пустой лист,для дальнейшей записи в него значений для новой сточки
                 w = []
                 #введем цикл для прохождения каждого столбика и добавления в них значений для новой строчки
                 for g in range(len(a.columns)) :
                    #вводим значения в тот пустой лист
                    w.append(input(f"Введите значение для {g} столбца : "))
                 #добавление листа в новую строчку в конце с обращением по последнему индексу len(a)
                 a.loc[len(a)] = w
              case 2: 
                  #добавление столбика
                  st = input("Введите название столбца : ")
                  #введем пустой лист для дальнейшего добавления в него значений для нового столбика
                  d = []
                   #введем цикл для прохождения каждой строчки и добавления в них значений для нового столбика
                  for h in range(len(a)) :
                     #вводим значения в тот пустой лист
                     d.append(input(f"Введите значение для {h} строчки : "))
                     #добавление листа в новый столбик в конце с названием st
                  a[st] = d
           print(a)
         case 2:
          #замена элемента
           f = input("Напишите , на что хотите заменить : ")
           #обращение к тому элементу, на котором мы сейчас, и замена его на элемент f
           a.iloc[i,j] = f
           print(a)
             

print(a)
