#добавляем нужную нам библиотеку
import numpy as np 
#вводим количество строк и столбцов для матрицы
N = int(input("Введите количество строк : "))
M = int(input("Введите количество столбцов : "))
#задаем функцию для добавления случайных значений элементов в матрицу
a = np.random.randint(0,1000,size = (N,M))
print(a)
#транспорируем матрицу
b = np.transpose(a)
print(b)
#задаем определители матрицы и её транспорированной версии
c = np.linalg.det(a)
d = np.linalg.det(b)
#сравниваем определители
if (d > c):
    print(d,">",c," Определитель d больше определителя c")
elif (d < c) : 
    print(d,"<",c," Определитель d меньше опредетителя c")
elif (np.isclose(d,c)) : #isclose - функция которая лучше определяет равны ли определители чем просто ==
    print(d,"=",c," Определители d и c равны")
